IDENTIFICATION DIVISION.
PROGRAM-ID. KUMIKOMI-SAMPLE1.
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
01 WORKING-AREA.
* 現在日時
03 GENZAI-DATE.
05 YY PIC X(4).
05 MM PIC X(2).
05 DD PIC X(2).
05 HH PIC X(2).
05 MI PIC X(2).
05 SS PIC X(2).
05 ETC PIC X(7).
* 表示エリア
03 DSP_BUF PIC X(128).
*-------------------------------------------
* 主手続
*-------------------------------------------
PROCEDURE DIVISION.
MAIN-PROCEDURE.
* 現在時刻の取得
MOVE FUNCTION CURRENT-DATE TO GENZAI-DATE.
* 現在時刻の表示
STRING "現在時刻： " YY "年" MM "月" DD "日" HH "時" MI "分"
DELIMITED BY SPACE
INTO DSP_BUF.
DISPLAY DSP_BUF.
END-PROC.
STOP RUN.
END PROGRAM KUMIKOMI-SAMPLE1.