IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
PROCEDURE DIVISION.
MAIN-PROCEDURE.
     DISPLAY "Hello, World!"
STOP RUN.
END PROGRAM HELLO-WORLD.
